src/bp-extension/Documents/СчетНаОплатуПокупателю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СчетНаОплатуПокупателю</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЛГ_ЗаявкаОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛГ_Заявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bp-extension/Documents/СчетНаОплатуПокупателю/Ext/ObjectModule.bsl
&Вместо("ОбработкаЗаполнения")
Процедура ЛГ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

    // Временная проверка вызова обработчика.

    Если ТипЗнч(ДанныеЗаполнения) <> Тип("ДокументСсылка.ЛГ_Заявка") Тогда
        ПродолжитьВызов(ДанныеЗаполнения, СтандартнаяОбработка);
        Возврат;
    КонецЕсли;

    Заявка = ДанныеЗаполнения;

    Если Не ЗначениеЗаполнено(Заявка.Организация)
        Или Не ЗначениеЗаполнено(Заявка.Контрагент)
        Или Не ЗначениеЗаполнено(Заявка.Договор) Тогда

        ВызватьИсключение
            "Перед созданием счёта заполните в заявке организацию, заказчика и договор.";

    КонецЕсли;

    ДанныеШапки = Новый Структура;
    ДанныеШапки.Вставить("Организация", Заявка.Организация);
    ДанныеШапки.Вставить("Контрагент", Заявка.Контрагент);
    ДанныеШапки.Вставить("ДоговорКонтрагента", Заявка.Договор);

    ПродолжитьВызов(ДанныеШапки, СтандартнаяОбработка);

    ЭтотОбъект.Организация = Заявка.Организация;
    ЭтотОбъект.ОрганизацияПолучатель = Заявка.Организация;
    ЭтотОбъект.Контрагент = Заявка.Контрагент;
    ЭтотОбъект.ДоговорКонтрагента = Заявка.Договор;
    ЭтотОбъект.СуммаВключаетНДС = Истина;

    Если Заявка.БезНДС Тогда
        ИмяСтавки = "БезНДС";
    Иначе
        ИмяСтавки = "НДС" + Формат(Заявка.СтавкаНДС, "ЧГ=0");
    КонецЕсли;

    ОписаниеСтавки = Метаданные.Перечисления.СтавкиНДС.
        ЗначенияПеречисления.Найти(ИмяСтавки);

    Если ОписаниеСтавки = Неопределено Тогда

        ВызватьИсключение
            "В этой версии Бухгалтерии нет ставки НДС: "
            + Строка(Заявка.СтавкаНДС)
            + "%. Проверьте ставку в заявке.";

    КонецЕсли;

    ЭтотОбъект.Товары.Очистить();
    СтрокаПеревозки = ЭтотОбъект.Товары.Добавить();

    СтрокаПеревозки.Содержание =
        "Перевозка по заявке № " + Заявка.Номер
        + ": " + Заявка.Загрузка_Пункт
        + " — " + Заявка.Выгрузка_Пункт;

    СтрокаПеревозки.Количество = 1;
    СтрокаПеревозки.Цена = Заявка.СуммаЗаявки;
    СтрокаПеревозки.Сумма = Заявка.СуммаЗаявки;
    СтрокаПеревозки.СтавкаНДС = Перечисления.СтавкиНДС[ИмяСтавки];

    Если Заявка.БезНДС Тогда

        СтрокаПеревозки.СуммаНДС = 0;

    Иначе

        СтрокаПеревозки.СуммаНДС = Окр(
            Заявка.СуммаЗаявки * Заявка.СтавкаНДС
            / (100 + Заявка.СтавкаНДС), 2);

    КонецЕсли;

    ЭтотОбъект.СуммаДокумента = Заявка.СуммаЗаявки;   
	
	
	    ЭтотОбъект.ЛГ_ЗаявкаОснование = Заявка;

КонецПроцедуры
